// 函数: sub_142973930
// 地址: 0x142973930
// 来自: E:\Embers\Embers\Binaries\Win64\Embers-Win64-Shipping.exe

__chkstk(0x100)
int64_t* rbp = arg4
int32_t rdi = 0
sub_1428d8e50(arg4)
int64_t* rax = sub_1428d8ba0(rbp)

if (rax != 0 && sub_142890e60(rax, arg2[1].d * 2) != 0)
    int32_t rcx_3 = arg2[1].d
    int64_t r8 = sx.q(rcx_3 - 1)
    
    if (rcx_3 - 1 s>= 0)
        int64_t r9_1 = r8 << 4
        int64_t temp0_1
        
        do
            int64_t rcx_4 = *(*arg2 + (r8 << 3))
            int64_t rdx_13 = (((((rcx_4 u>> 1 & 0x80000000) | (rcx_4 & 0x200000000)) u>> 1
                | (rcx_4 & 0x400000000)) u>> 1 | (rcx_4 & 0x800000000)) u>> 1 | (rcx_4 & 0x1000000000))
                u>> 1 | (rcx_4 & 0x2000000000)
            uint64_t rdx_24 = (((
                ((rdx_13 u>> 1 | (rcx_4 & 0x4000000000)) u>> 1 | (rcx_4 & 0x8000000000)) u>> 1
                | (rcx_4 & 0x10000000000)) u>> 1 | (rcx_4 & 0x20000000000)) u>> 1
                | (rcx_4 & 0x40000000000)) u>> 1
            int64_t rdx_35 = (((
                ((rdx_24 | (rcx_4 & 0x80000000000)) u>> 1 | (rcx_4 & 0x100000000000)) u>> 1
                | (rcx_4 & 0x200000000000)) u>> 1 | (rcx_4 & 0x400000000000)) u>> 1
                | (rcx_4 & 0x800000000000)) u>> 1 | (rcx_4 & 0x1000000000000)
            uint64_t rdx_46 = (((
                ((rdx_35 u>> 1 | (rcx_4 & 0x2000000000000)) u>> 1 | (rcx_4 & 0x4000000000000)) u>> 1
                | (rcx_4 & 0x8000000000000)) u>> 1 | (rcx_4 & 0x10000000000000)) u>> 1
                | (rcx_4 & 0x20000000000000)) u>> 1
            int64_t rdx_57 = (((
                ((rdx_46 | (rcx_4 & 0x40000000000000)) u>> 1 | (rcx_4 & 0x80000000000000)) u>> 1
                | (rcx_4 & 0x100000000000000)) u>> 1 | (rcx_4 & 0x200000000000000)) u>> 1
                | (rcx_4 & 0x400000000000000)) u>> 1 | (rcx_4 & 0x800000000000000)
            *(*rax + r9_1 + 8) = ((((rdx_57 u>> 1 | (rcx_4 & 0x1000000000000000)) u>> 1
                | (rcx_4 & 0x2000000000000000)) u>> 1 | (rcx_4 & 0x4000000000000000)) u>> 1
                | (rcx_4 & 0x8000000000000001)) u>> 1
            int64_t rcx_6 = *(*arg2 + (r8 << 3))
            int64_t rdx_76 = ((((((((rcx_6 & 0x80000000) * 2) | (zx.q(rcx_6.d) & 0x40000000)) * 2)
                | (zx.q(rcx_6.d) & 0x20000000)) * 2) | (zx.q(rcx_6.d) & 0x10000000)) * 2)
                | (zx.q(rcx_6.d) & 0x8000000)
            int64_t rdx_84 = (((((((rdx_76 * 2) | (zx.q(rcx_6.d) & 0x4000000)) * 2)
                | (zx.q(rcx_6.d) & 0x2000000)) * 2) | (zx.q(rcx_6.d) & 0x1000000)) * 2)
                | (zx.q(rcx_6.d) & 0x800000)
            int64_t rdx_92 = (((((((rdx_84 * 2) | (zx.q(rcx_6.d) & 0x400000)) * 2)
                | (zx.q(rcx_6.d) & 0x200000)) * 2) | (zx.q(rcx_6.d) & 0x100000)) * 2)
                | (zx.q(rcx_6.d) & 0x80000)
            int64_t rdx_100 = (((((((rdx_92 * 2) | (zx.q(rcx_6.d) & 0x40000)) * 2)
                | (zx.q(rcx_6.d) & 0x20000)) * 2) | (zx.q(rcx_6.d) & 0x10000)) * 2)
                | (zx.q(rcx_6.d) & 0x8000)
            int64_t rdx_108 = (((((((rdx_100 * 2) | (zx.q(rcx_6.d) & 0x4000)) * 2)
                | (zx.q(rcx_6.d) & 0x2000)) * 2) | (zx.q(rcx_6.d) & 0x1000)) * 2)
                | (zx.q(rcx_6.d) & 0x800)
            int64_t rdx_116 = (((((((rdx_108 * 2) | (zx.q(rcx_6.d) & 0x400)) * 2)
                | (zx.q(rcx_6.d) & 0x200)) * 2) | (zx.q(rcx_6.d) & 0x100)) * 2)
                | (zx.q(rcx_6.d) & 0x80)
            r9_1 -= 0x10
            int64_t rdx_124 = (((((((rdx_116 * 2) | (zx.q(rcx_6.d) & 0x40)) * 2)
                | (zx.q(rcx_6.d) & 0x20)) * 2) | (zx.q(rcx_6.d) & 0x10)) * 2) | (zx.q(rcx_6.d) & 8)
            temp0_1 = r8
            r8 -= 1
            *(r9_1 + *rax + 0x10) = (((((rdx_124 * 2) | (zx.q(rcx_6.d) & 4)) * 2)
                | (zx.q(rcx_6.d) & 2)) * 2) | (zx.q(rcx_6.d) & 1)
        while (temp0_1 - 1 s>= 0)
        rcx_3 = arg2[1].d
        rbp = arg4
    
    rax[1].d = rcx_3 * 2
    sub_142890ce0(rax)
    
    if (sub_142972740(arg1, rax, arg3) != 0)
        rdi = 1

sub_1428d8a60(rbp)
return zx.q(rdi)
